In [2]:
import pandas as pd
import numpy as snp

In [3]:
df=pd.read_csv('data_science_job.csv')

In [4]:
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,20.0,NaN,NaN,36.0,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15.0,50-99,Pvt Ltd,47.0,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5.0,NaN,NaN,83.0,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,0.0,NaN,Pvt Ltd,52.0,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,20.0,50-99,Funded Startup,8.0,0.0

In [9]:
df.isnull().mean()*100

enrollee_id                0.000000
city                       0.000000
city_development_index     2.500261
gender                    23.530640
relevent_experience        0.000000
enrolled_university        2.014824
education_level            2.401086
major_discipline          14.683161
experience                 0.339284
company_size              30.994885
company_type              32.049274
training_hours             3.998330
target                     0.000000
dtype: float64

In [6]:
df.shape

(19158, 13)

In [12]:
# we will going to apply CCA on missing data less han 5%
# cols=[var for var in df.columns if df[var].isnull().mean()*100<0.05 and df[var].isnull().mean()>0]
# cols

[]

In [13]:
cols = [var for var in df.columns if df[var].isnull().mean() < 0.05 and df[var].isnull().mean() > 0]
cols

['city_development_index',
 'enrolled_university',
 'education_level',
 'experience',
 'training_hours']

In [14]:
df[cols].sample(8)

,city_development_index,enrolled_university,education_level,experience,training_hours
7590,0.579,Part time course,High School,4.0,43.0
12890,NaN,no_enrollment,Graduate,20.0,23.0
6226,0.910,Part time course,Graduate,5.0,30.0
2285,0.804,no_enrollment,Graduate,10.0,9.0
14618,0.698,no_enrollment,Graduate,17.0,31.0
794,0.939,no_enrollment,Masters,2.0,28.0
14163,0.624,Full time course,Graduate,3.0,61.0
7472,NaN,no_enrollment,Phd,10.0,163.0

In [15]:
len(df[cols].dropna())/len(df)   # ckecking kitna nuksaaan hoga rows ko drop karne se  and how much correct data left

0.8968577095730244

In [20]:
new_df=df[cols].dropna()
df.shape,new_df.shape

((19158, 13), (17182, 5))